app/controllers/posts_controller.rb

    def index
        @posts = Post.where.not(image: nil)
---
SELECT "posts".* FROM "posts" WHERE "posts"."image" IS NOT NULL

    def create
    #     file = params[:image]
    # name = file.original_filename
    # # 出力先のパスを設定※今回は、public/docs配下に配置
    # output_path = Rails.root.join('public/upload', name)
    # # ファイルを出力
    # File.open(output_path, 'wb'){ |f| f.write(file.read) }
    #     @post = Post.new(shop: params[:shop],food: params[:food],name: params[:name],content: params[:content],image: params[:image])

    #     #@post.user_id = current_user.id
        @post_new=Post.new(post_params)
        @post_new.user_id=current_user.id
        if @post_new.save
---
INSERT INTO "posts" ("created_at", "updated_at", "user_id", "food", "shop", "name", "content", "image") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def update
        @post = Post.find(params[:id])
        if @post.update(post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "image" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["image", "20220302004442.jpg"], ["updated_at", "2022-03-01 15:44:42.529024"], ["id", 1]]

    def search
        @posts = Post.where(food: params[:keyword])
---
SELECT "posts".* FROM "posts" WHERE "posts"."food" = ?  [["food", "ラーメン"]]