app/controllers/users_controller.rb

    def show
        @user=User.find(params[:id])
        @user.introduction ||= ""
        @posts=Post.where(user_id: @user.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 2]]

    def update
        @user = User.find(params[:id])
        if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["introduction", "ｇ"], ["updated_at", "2022-03-01 15:20:55.971459"], ["id", 1]]